
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四节 死锁 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    第一章 计算机系统概述
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../01/1.html">
            
                <a href="../01/1.html">
            
                    
                    第一节 操作系统的基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../01/2.html">
            
                <a href="../01/2.html">
            
                    
                    第二节 操作系统的发展与分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../01/3.html">
            
                <a href="../01/3.html">
            
                    
                    第三节 操作系统的运行环境
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../01/4.html">
            
                <a href="../01/4.html">
            
                    
                    第四节 操作系统的体系结构
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    第二章 进程管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一节 进程与线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二节 处理机调度
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三节  进程同步
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四节 死锁
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    第三章 内存管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../03/1.html">
            
                <a href="../03/1.html">
            
                    
                    第一节 内存管理概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../03/2.html">
            
                <a href="../03/2.html">
            
                    
                    第二节 虚拟内存管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    第四章 文件管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../04/1.html">
            
                <a href="../04/1.html">
            
                    
                    第一节  文件系统基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../04/2.html">
            
                <a href="../04/2.html">
            
                    
                    第二节 文件系统实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../04/3.html">
            
                <a href="../04/3.html">
            
                    
                    第三节 磁盘组织及管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    第五章 输入输出管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../05/1.html">
            
                <a href="../05/1.html">
            
                    
                    第一节 I/O管理概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="../05/2.html">
            
                <a href="../05/2.html">
            
                    
                    第二节 I/O核心子系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第四节 死锁</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x56DB;&#x3001;&#x6B7B;&#x9501;">&#x56DB;&#x3001;&#x6B7B;&#x9501;</h1>
<h2 id="41-&#x6B7B;&#x9501;&#x7684;&#x6982;&#x5FF5;">4.1 &#x6B7B;&#x9501;&#x7684;&#x6982;&#x5FF5;</h2>
<h3 id="411-&#x6B7B;&#x9501;&#x7684;&#x5B9A;&#x4E49;">4.1.1 &#x6B7B;&#x9501;&#x7684;&#x5B9A;&#x4E49;</h3>
<p>&#x5728;&#x5E76;&#x53D1;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5404;&#x8FDB;&#x7A0B;&#x56E0;&#x7ADE;&#x4E89;&#x8D44;&#x6E90;&#x800C;&#x9020;&#x6210;&#x7684;&#x4E00;&#x79CD;&#x4E92;&#x76F8;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x624B;&#x91CC;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5BFC;&#x81F4;&#x5404;&#x8FDB;&#x7A0B;&#x90FD;&#x963B;&#x585E;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x5C31;&#x662F;&#x201C;&#x6B7B;&#x9501;&#x201D;&#x3002;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x540E;&#x82E5;&#x65E0;&#x5916;&#x529B;&#x5E72;&#x6D89;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x90FD;&#x5C06;&#x65E0;&#x6CD5;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x3002;</p>
<h3 id="412-&#x6B7B;&#x9501;&#x3001;&#x9965;&#x997F;&#x3001;&#x6B7B;&#x5FAA;&#x73AF;&#x7684;&#x533A;&#x522B;">4.1.2 &#x6B7B;&#x9501;&#x3001;&#x9965;&#x997F;&#x3001;&#x6B7B;&#x5FAA;&#x73AF;&#x7684;&#x533A;&#x522B;</h3>
<p>&#x6B7B;&#x9501;&#xFF1A;&#x5404;&#x8FDB;&#x7A0B;&#x4E92;&#x76F8;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x624B;&#x91CC;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5BFC;&#x81F4;&#x5404;&#x8FDB;&#x7A0B;&#x90FD;&#x963B;&#x585E;&#xFF0C;&#x65E0;&#x6CD5;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x9965;&#x997F;&#xFF1A;&#x7531;&#x4E8E;&#x957F;&#x671F;&#x5F97;&#x4E0D;&#x5230;&#x60F3;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x67D0;&#x8FDB;&#x7A0B;&#x65E0;&#x6CD5;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x5728;&#x77ED;&#x8FDB;&#x7A0B;&#x4F18;&#x5148;&#xFF08;SPF&#xFF09;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x82E5;&#x6709;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x77ED;&#x8FDB;&#x7A0B;&#x5230;&#x6765;&#xFF0C;&#x5219;&#x957F;&#x8FDB;&#x7A0B;&#x5C06;&#x4E00;&#x76F4;&#x5F97;&#x4E0D;&#x5230;&#x5904;&#x7406;&#x673A;&#xFF0C;&#x4ECE;&#x800C;&#x53D1;&#x751F;&#x957F;&#x8FDB;&#x7A0B;&#x201C;&#x9965;&#x997F;&#x201D;&#x3002;</p>
<p>&#x6B7B;&#x5FAA;&#x73AF;&#xFF1A;&#x67D0;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E00;&#x76F4;&#x8DF3;&#x4E0D;&#x51FA;&#x67D0;&#x4E2A;&#x5FAA;&#x73AF;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x6709;&#x65F6;&#x662F;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;bug &#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x6545;&#x610F;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x540D;&#x79F0;</th>
<th>&#x5171;&#x540C;&#x70B9;</th>
<th>&#x533A;&#x522B;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x6B7B;&#x9501;</td>
<td></td>
<td>&#x6B7B;&#x9501;&#x4E00;&#x5B9A;&#x662F;&#x201C;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x624B;&#x91CC;&#x7684;&#x8D44;&#x6E90;&#x201D;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x6709;&#x6B7B;&#x9501;&#x73B0;&#x8C61;&#xFF0C;&#x90A3;&#x81F3;&#x5C11;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x8FDB;&#x7A0B;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x8FDB;&#x7A0B;&#x4E00;&#x5B9A;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x6001;&#x3002;</td>
</tr>
<tr>
<td>&#x9965;&#x997F;</td>
<td>&#x90FD;&#x662F;&#x8FDB;&#x7A0B;&#x65E0;&#x6CD5;&#x987A;&#x5229;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x7684;&#x73B0;&#x8C61;&#xFF08;&#x6545;&#x610F;&#x8BBE;&#x8BA1;&#x7684;&#x6B7B;&#x5FAA;&#x73AF;&#x9664;&#x5916;&#xFF09;</td>
<td>&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53D1;&#x751F;&#x9965;&#x997F;&#x3002;&#x53D1;&#x751F;&#x9965;&#x997F;&#x7684;&#x8FDB;&#x7A0B;&#x65E2;&#x53EF;&#x80FD;&#x662F;&#x963B;&#x585E;&#x6001;(&#x5982;&#x957F;&#x671F;&#x5F97;&#x4E0D;&#x5230;&#x9700;&#x8981;&#x7684;I/O&#x8BBE;&#x5907;)&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5C31;&#x7EEA;&#x6001;(&#x957F;&#x671F;&#x5F97;&#x4E0D;&#x5230;&#x5904;&#x7406;&#x673A;)</td>
</tr>
<tr>
<td>&#x6B7B;&#x5FAA;&#x73AF;</td>
<td></td>
<td>&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53D1;&#x751F;&#x6B7B;&#x5FAA;&#x73AF;&#x3002;&#x6B7B;&#x5FAA;&#x73AF;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x4E0A;&#x5904;&#x7406;&#x673A;&#x8FD0;&#x884C;&#xFF08;&#x53EF;&#x4EE5;&#x662F;&#x8FD0;&#x884C;&#x6001;&#xFF09;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x65E0;&#x6CD5;&#x50CF;&#x671F;&#x5F85;&#x7684;&#x90A3;&#x6837;&#x987A;&#x5229;&#x63A8;&#x8FDB;&#x3002;&#x6B7B;&#x9501;&#x548C;&#x9965;&#x997F;&#x95EE;&#x9898;&#x662F;&#x7531;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x7684;&#x7B56;&#x7565;&#x4E0D;&#x5408;&#x7406;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x800C;&#x6B7B;&#x5FAA;&#x73AF;&#x662F;&#x7531;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x7684;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x7684;&#x3002;&#x6B7B;&#x9501;&#x548C;&#x9965;&#x997F;&#x662F;&#x7BA1;&#x7406;&#x8005;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6B7B;&#x5FAA;&#x73AF;&#x662F;&#x88AB;&#x7BA1;&#x7406;&#x8005;&#x7684;&#x95EE;&#x9898;&#x3002;</td>
</tr>
</tbody>
</table>
<h3 id="413-&#x6B7B;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;">4.1.3 &#x6B7B;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;</h3>
<p>&#x4EA7;&#x751F;&#x6B7B;&#x9501;&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x56DB;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x53EA;&#x8981;&#x5176;&#x4E2D;&#x4EFB;&#x4E00;&#x6761;&#x4EF6;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x6B7B;&#x9501;&#x5C31;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<ul>
<li>&#x4E92;&#x65A5;&#x6761;&#x4EF6;&#xFF1A;&#x53EA;&#x6709;&#x5BF9;&#x5FC5;&#x987B;&#x4E92;&#x65A5;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x4E89;&#x62A2;&#x624D;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#xFF08;&#x5982;&#x54F2;&#x5B66;&#x5BB6;&#x7684;&#x7B77;&#x5B50;&#x3001;&#x6253;&#x5370;&#x673A;&#x8BBE;&#x5907;&#xFF09;&#x3002;&#x50CF;&#x5185;&#x5B58;&#x3001;&#x626C;&#x58F0;&#x5668;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8BA9;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x662F;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#x7684;&#xFF08;&#x56E0;&#x4E3A;&#x8FDB;&#x7A0B;&#x4E0D;&#x7528;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x8FD9;&#x79CD;&#x8D44;&#x6E90;&#xFF09;&#x3002;</li>
<li>&#x4E0D;&#x5265;&#x593A;&#x6761;&#x4EF6;&#xFF1A;&#x8FDB;&#x7A0B;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x5728;&#x672A;&#x4F7F;&#x7528;&#x5B8C;&#x4E4B;&#x524D;&#xFF0C;<strong>&#x4E0D;&#x80FD;&#x7531;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5F3A;&#x884C;&#x593A;&#x8D70;</strong>&#xFF0C;&#x53EA;&#x80FD;&#x4E3B;&#x52A8;&#x91CA;&#x653E;&#x3002;</li>
<li>&#x8BF7;&#x6C42;&#x548C;&#x4FDD;&#x6301;&#x6761;&#x4EF6;&#xFF1A;&#x8FDB;&#x7A0B;<strong>&#x5DF2;&#x7ECF;&#x4FDD;&#x6301;&#x4E86;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;</strong>&#xFF0C;&#x4F46;&#x53C8;&#x63D0;&#x51FA;&#x4E86;&#x65B0;&#x7684;&#x8D44;&#x6E90;<strong>&#x8BF7;&#x6C42;</strong>&#xFF0C;&#x800C;&#x8BE5;&#x8D44;&#x6E90;&#x53C8;&#x88AB;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5360;&#x6709;&#xFF0C;&#x6B64;&#x65F6;&#x8BF7;&#x6C42;&#x8FDB;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x4F46;&#x53C8;&#x5BF9;&#x81EA;&#x5DF1;&#x5DF2;&#x6709;&#x7684;&#x8D44;&#x6E90;<strong>&#x4FDD;&#x6301;</strong>&#x4E0D;&#x653E;&#x3002;</li>
<li>&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x6761;&#x4EF6;&#xFF1A;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x8FDB;&#x7A0B;<strong>&#x8D44;&#x6E90;&#x7684;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x94FE;</strong>&#xFF0C;&#x94FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5DF2;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x540C;&#x65F6;&#x88AB;&#x4E0B;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6240;&#x8BF7;&#x6C42;&#x3002;</li>
</ul>
<blockquote>
<p>&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x65F6;&#x4E00;&#x5B9A;&#x6709;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x751F;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x65F6;&#x672A;&#x5FC5;&#x6B7B;&#x9501;&#xFF08;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x662F;&#x6B7B;&#x9501;&#x7684;&#x5FC5;&#x8981;&#x4E0D;&#x5145;&#x5206;&#x6761;&#x4EF6;&#xFF09;&#x3002;&#x5982;&#x679C;&#x540C;&#x7C7B;&#x8D44;&#x6E90;&#x6570;&#x5927;&#x4E8E;1&#xFF0C;&#x5219;&#x5373;&#x4F7F;&#x6709;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#xFF0C;&#x4E5F;&#x672A;&#x5FC5;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6BCF;&#x7C7B;&#x8D44;&#x6E90;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x5C31;&#x662F;&#x6B7B;&#x9501;&#x7684;&#x5145;&#x5206;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x4E86;&#x3002;</p>
</blockquote>
<h3 id="414-&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x65F6;&#x673A;">4.1.4 &#x53D1;&#x751F;&#x6B7B;&#x9501;&#x7684;&#x65F6;&#x673A;</h3>
<ol>
<li>&#x5BF9;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x7ADE;&#x4E89;&#x3002;&#x5404;&#x8FDB;&#x7A0B;&#x5BF9;&#x4E0D;&#x53EF;&#x5265;&#x593A;&#x7684;&#x8D44;&#x6E90;&#xFF08;&#x5982;&#x6253;&#x5370;&#x673A;&#xFF09;&#x7684;&#x7ADE;&#x4E89;&#x53EF;&#x80FD;&#x5F15;&#x8D77;&#x6B7B;&#x9501;&#xFF0C;&#x5BF9;&#x53EF;&#x5265;&#x593A;&#x7684;&#x8D44;&#x6E90;&#xFF08;CPU&#xFF09;&#x7684;&#x7ADE;&#x4E89;&#x662F;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;&#x6B7B;&#x9501;&#x7684;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;&#x63A8;&#x8FDB;&#x987A;&#x5E8F;&#x975E;&#x6CD5;&#x3002;&#x8BF7;&#x6C42;&#x548C;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x7684;&#x987A;&#x5E8F;&#x4E0D;&#x5F53;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;P1&#x3001;P2 &#x5206;&#x522B;&#x7533;&#x8BF7;&#x5E76;&#x5360;&#x6709;&#x4E86;&#x8D44;&#x6E90;R1&#x3001;R2&#xFF0C;&#x4E4B;&#x540E;&#x8FDB;&#x7A0B;P1&#x53C8;&#x7D27;&#x63A5;&#x7740;&#x7533;&#x8BF7;&#x8D44;&#x6E90;R2&#xFF0C;&#x800C;&#x8FDB;&#x7A0B;P2&#x53C8;&#x7533;&#x8BF7;&#x8D44;&#x6E90;R1&#xFF0C;&#x4E24;&#x8005;&#x4F1A;&#x56E0;&#x4E3A;&#x7533;&#x8BF7;&#x7684;&#x8D44;&#x6E90;&#x88AB;&#x5BF9;&#x65B9;&#x5360;&#x6709;&#x800C;&#x963B;&#x585E;&#xFF0C;&#x4ECE;&#x800C;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;</li>
<li>&#x4FE1;&#x53F7;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x4E5F;&#x4F1A;&#x9020;&#x6210;&#x6B7B;&#x9501;&#x3002;&#x5982;&#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5B9E;&#x73B0;&#x4E92;&#x65A5;&#x7684;P&#x64CD;&#x4F5C;&#x5728;&#x5B9E;&#x73B0;&#x540C;&#x6B65;&#x7684;P&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#x3002;&#xFF08;&#x53EF;&#x4EE5;&#x628A;&#x4E92;&#x65A5;&#x4FE1;&#x53F7;&#x91CF;&#x3001;&#x540C;&#x6B65;&#x4FE1;&#x53F7;&#x91CF;&#x4E5F;&#x770B;&#x505A;&#x662F;&#x4E00;&#x79CD;&#x62BD;&#x8C61;&#x7684;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF09;</li>
</ol>
<h2 id="42-&#x6B7B;&#x9501;&#x7684;&#x5904;&#x7406;&#x7B56;&#x7565;">4.2 &#x6B7B;&#x9501;&#x7684;&#x5904;&#x7406;&#x7B56;&#x7565;</h2>
<ol>
<li>&#x9884;&#x9632;&#x6B7B;&#x9501;&#x3002;&#x7834;&#x574F;&#x6B7B;&#x9501;&#x4EA7;&#x751F;&#x7684;&#x56DB;&#x4E2A;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x51E0;&#x4E2A;&#x3002;</li>
<li>&#x907F;&#x514D;&#x6B7B;&#x9501;&#x3002;&#x7528;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x9632;&#x6B62;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x6B7B;&#x9501;&#xFF08;&#x94F6;&#x884C;&#x5BB6;&#x7B97;&#x6CD5;&#xFF09;</li>
<li>&#x6B7B;&#x9501;&#x7684;&#x68C0;&#x6D4B;&#x548C;&#x89E3;&#x9664;&#x3002;&#x5141;&#x8BB8;&#x6B7B;&#x9501;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x4E0D;&#x8FC7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8D1F;&#x8D23;&#x68C0;&#x6D4B;&#x51FA;&#x6B7B;&#x9501;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x7136;&#x540E;&#x91C7;&#x53D6;&#x67D0;&#x79CD;&#x63AA;&#x65BD;&#x89E3;&#x9664;&#x6B7B;&#x9501;&#x3002;</li>
</ol>
<h2 id="43-&#x9884;&#x9632;&#x6B7B;&#x9501;">4.3 &#x9884;&#x9632;&#x6B7B;&#x9501;</h2>
<ol>
<li>&#x7834;&#x574F;&#x4E92;&#x65A5;&#x6761;&#x4EF6;</li>
</ol>
<p>&#x4E92;&#x65A5;&#x6761;&#x4EF6;&#xFF1A;&#x53EA;&#x6709;&#x5BF9;&#x5FC5;&#x987B;&#x4E92;&#x65A5;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x4E89;&#x62A2;&#x624D;&#x4F1A;&#x5BFC;&#x81F4;&#x6B7B;&#x9501;&#x3002;&#x5982;&#x679C;&#x628A;&#x53EA;&#x80FD;&#x4E92;&#x65A5;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x6539;&#x9020;&#x4E3A;&#x5141;&#x8BB8;&#x5171;&#x4EAB;&#x4F7F;&#x7528;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x8FDB;&#x5165;&#x6B7B;&#x9501;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8BE5;&#x7B56;&#x7565;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x90FD;&#x53EF;&#x4EE5;&#x6539;&#x9020;&#x6210;&#x53EF;&#x5171;&#x4EAB;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x5E76;&#x4E14;&#x4E3A;&#x4E86;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#xFF0C;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x8FD8;&#x5FC5;&#x987B;&#x4FDD;&#x62A4;&#x8FD9;&#x79CD;&#x4E92;&#x65A5;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x90FD;&#x65E0;&#x6CD5;&#x7834;&#x574F;&#x4E92;&#x65A5;&#x6761;&#x4EF6;&#x3002;</p>
<ol>
<li>&#x7834;&#x574F;&#x4E0D;&#x5265;&#x593A;&#x6761;&#x4EF6;</li>
</ol>
<p>&#x4E0D;&#x5265;&#x593A;&#x6761;&#x4EF6;&#xFF1A;&#x8FDB;&#x7A0B;&#x6240;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x5728;&#x672A;&#x4F7F;&#x7528;&#x5B8C;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x80FD;&#x7531;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5F3A;&#x884C;&#x593A;&#x8D70;&#xFF0C;&#x53EA;&#x80FD;&#x4E3B;&#x52A8;&#x91CA;&#x653E;&#x3002;&#x7834;&#x574F;&#x4E0D;&#x5265;&#x593A;&#x6761;&#x4EF6;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#xFF1A;</p>
<ul>
<li>&#x65B9;&#x6848;&#x4E00;&#xFF1A;&#x5F53;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BF7;&#x6C42;&#x65B0;&#x7684;&#x8D44;&#x6E90;&#x5F97;&#x4E0D;&#x5230;&#x6EE1;&#x8DB3;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x4FDD;&#x6301;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x5F85;&#x4EE5;&#x540E;&#x9700;&#x8981;&#x65F6;&#x518D;&#x91CD;&#x65B0;&#x7533;&#x8BF7;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x67D0;&#x4E9B;&#x8D44;&#x6E90;&#x5C1A;&#x672A;&#x4F7F;&#x7528;&#x5B8C;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x91CA;&#x653E;&#xFF0C;&#x4ECE;&#x800C;&#x7834;&#x574F;&#x4E86;&#x4E0D;&#x53EF;&#x5265;&#x593A;&#x6761;&#x4EF6;&#x3002;</li>
<li>&#x65B9;&#x6848;&#x4E8C;&#xFF1A;&#x5F53;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x88AB;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x6240;&#x5360;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x534F;&#x52A9;&#xFF0C;&#x5C06;&#x60F3;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x5F3A;&#x884C;&#x5265;&#x593A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E00;&#x822C;&#x9700;&#x8981;&#x8003;&#x8651;&#x5404;&#x8FDB;&#x7A0B;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF08;&#x6BD4;&#x5982;&#xFF1A;&#x5265;&#x593A;&#x8C03;&#x5EA6;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x5C06;&#x5904;&#x7406;&#x673A;&#x8D44;&#x6E90;&#x5F3A;&#x884C;&#x5265;&#x593A;&#x7ED9;&#x4F18;&#x5148;&#x7EA7;&#x66F4;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#xFF09;</li>
</ul>
<p>&#x8BE5;&#x7B56;&#x7565;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;</p>
<ul>
<li><p>&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x3002;</p>
</li>
<li><p>&#x91CA;&#x653E;&#x5DF2;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x524D;&#x4E00;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x7684;&#x5931;&#x6548;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E00;&#x822C;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x6613;&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;&#x72B6;&#x6001;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5982;CPU&#x3002;</p>
</li>
<li><p>&#x53CD;&#x590D;&#x5730;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x4F1A;&#x589E;&#x52A0;&#x7CFB;&#x7EDF;&#x5F00;&#x9500;&#xFF0C;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
</li>
<li><p>&#x82E5;&#x91C7;&#x7528;&#x65B9;&#x6848;&#x4E00;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x53EA;&#x8981;&#x6682;&#x65F6;&#x5F97;&#x4E0D;&#x5230;&#x67D0;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x4E4B;&#x524D;&#x83B7;&#x5F97;&#x7684;&#x90A3;&#x4E9B;&#x8D44;&#x6E90;&#x5C31;&#x90FD;&#x9700;&#x8981;&#x653E;&#x5F03;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x91CD;&#x65B0;&#x7533;&#x8BF7;&#x3002;&#x5982;&#x679C;&#x4E00;&#x76F4;&#x53D1;&#x751F;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8FDB;&#x7A0B;&#x9965;&#x997F;&#x3002;</p>
</li>
<li><p>&#x7834;&#x574F;&#x8BF7;&#x6C42;&#x548C;&#x4FDD;&#x6301;&#x6761;&#x4EF6;</p>
</li>
</ul>
<p>&#x8BF7;&#x6C42;&#x548C;&#x4FDD;&#x6301;&#x6761;&#x4EF6;&#xFF1A;&#x8FDB;&#x7A0B;&#x5DF2;&#x7ECF;&#x4FDD;&#x6301;&#x4E86;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x53C8;&#x63D0;&#x51FA;&#x4E86;&#x65B0;&#x7684;&#x8D44;&#x6E90;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x8BE5;&#x8D44;&#x6E90;&#x53C8;&#x88AB;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5360;&#x6709;&#xFF0C;&#x6B64;&#x65F6;&#x8BF7;&#x6C42;&#x8FDB;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x4F46;&#x53C8;&#x5BF9;&#x81EA;&#x5DF1;&#x5DF2;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x4FDD;&#x6301;&#x4E0D;&#x653E;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x9759;&#x6001;&#x5206;&#x914D;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x8FDB;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x524D;&#x4E00;&#x6B21;&#x7533;&#x8BF7;&#x5B8C;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;&#x5168;&#x90E8;&#x8D44;&#x6E90;&#xFF0C;&#x5728;&#x5B83;&#x7684;&#x8D44;&#x6E90;&#x672A;&#x6EE1;&#x8DB3;&#x524D;&#xFF0C;&#x4E0D;&#x8BA9;&#x5B83;&#x6295;&#x5165;&#x8FD0;&#x884C;&#x3002;&#x4E00;&#x65E6;&#x6295;&#x5165;&#x8FD0;&#x884C;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x5C31;&#x4E00;&#x76F4;&#x5F52;&#x5B83;&#x6240;&#x6709;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x5C31;&#x4E0D;&#x4F1A;&#x518D;&#x8BF7;&#x6C42;&#x522B;&#x7684;&#x4EFB;&#x4F55;&#x8D44;&#x6E90;&#x4E86;&#x3002;&#x8BE5;&#x7B56;&#x7565;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;&#x6709;&#x4E9B;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x7528;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x8FDB;&#x7A0B;&#x7684;&#x6574;&#x4E2A;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x90FD;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x7740;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x4E25;&#x91CD;&#x7684;&#x8D44;&#x6E90;&#x6D6A;&#x8D39;&#xFF0C;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x6781;&#x4F4E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8BE5;&#x7B56;&#x7565;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x67D0;&#x4E9B;&#x8FDB;&#x7A0B;&#x9965;&#x997F;&#x3002;</p>
<ol>
<li>&#x7834;&#x574F;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x6761;&#x4EF6;</li>
</ol>
<p>&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x6761;&#x4EF6;&#xFF1A;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;&#x7684;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x94FE;&#xFF0C;&#x94FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5DF2;&#x83B7;&#x5F97;&#x7684;&#x8D44;&#x6E90;&#x540C;&#x65F6;&#x88AB;&#x4E0B;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6240;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x53EF;&#x91C7;&#x7528;&#x987A;&#x5E8F;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x6CD5;&#x3002;&#x9996;&#x5148;&#x7ED9;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8D44;&#x6E90;&#x7F16;&#x53F7;&#xFF0C;&#x89C4;&#x5B9A;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x6309;&#x7F16;&#x53F7;&#x9012;&#x589E;&#x7684;&#x987A;&#x5E8F;&#x8BF7;&#x6C42;&#x8D44;&#x6E90;&#xFF0C;&#x540C;&#x7C7B;&#x8D44;&#x6E90;&#xFF08;&#x5373;&#x7F16;&#x53F7;&#x76F8;&#x540C;&#x7684;&#x8D44;&#x6E90;&#xFF09;&#x4E00;&#x6B21;&#x7533;&#x8BF7;&#x5B8C;&#x3002;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EA;&#x6709;&#x5DF2;&#x5360;&#x6709;&#x5C0F;&#x7F16;&#x53F7;&#x7684;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x624D;&#x6709;&#x8D44;&#x683C;&#x7533;&#x8BF7;&#x66F4;&#x5927;&#x7F16;&#x53F7;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x6309;&#x6B64;&#x89C4;&#x5219;&#xFF0C;&#x5DF2;&#x6301;&#x6709;&#x5927;&#x7F16;&#x53F7;&#x8D44;&#x6E90;&#x7684;&#x8FDB;&#x7A0B;&#x4E0D;&#x53EF;&#x80FD;&#x9006;&#x5411;&#x5730;&#x56DE;&#x6765;&#x7533;&#x8BF7;&#x5C0F;&#x7F16;&#x53F7;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4ECE;&#x800C;&#x5C31;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5FAA;&#x73AF;&#x7B49;&#x5F85;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x8BE5;&#x7B56;&#x7565;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;</p>
<ul>
<li><p>&#x4E0D;&#x65B9;&#x4FBF;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x6240;&#x6709;&#x7684;&#x7F16;&#x53F7;&#xFF1B;</p>
</li>
<li><p>&#x8FDB;&#x7A0B;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x987A;&#x5E8F;&#x53EF;&#x80FD;&#x548C;&#x7F16;&#x53F7;&#x9012;&#x589E;&#x987A;&#x5E8F;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8D44;&#x6E90;&#x6D6A;&#x8D39;&#xFF1B;</p>
</li>
<li>&#x5FC5;&#x987B;&#x6309;&#x89C4;&#x5B9A;&#x6B21;&#x5E8F;&#x7533;&#x8BF7;&#x8D44;&#x6E90;&#xFF0C;&#x7528;&#x6237;&#x7F16;&#x7A0B;&#x9EBB;&#x70E6;&#x3002;</li>
</ul>
<h2 id="44-&#x907F;&#x514D;&#x6B7B;&#x9501;">4.4 &#x907F;&#x514D;&#x6B7B;&#x9501;</h2>
<h3 id="441-&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x72B6;&#x6001;">4.4.1 &#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x72B6;&#x6001;</h3>
<p>&#x6240;&#x8C13;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#xFF0C;&#x5C31;&#x662F;&#x6307;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x5E8F;&#x5217;&#x5206;&#x914D;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x80FD;&#x987A;&#x5229;&#x5B8C;&#x6210;&#x3002;&#x53EA;&#x8981;&#x80FD;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x5B89;&#x5168;&#x72B6;&#x6001;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5206;&#x914D;&#x4E86;&#x8D44;&#x6E90;&#x4E4B;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x627E;&#x4E0D;&#x51FA;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x8FDB;&#x5165;&#x4E86;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4E4B;&#x540E;&#x53EF;&#x80FD;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x90FD;&#x65E0;&#x6CD5;&#x987A;&#x5229;&#x7684;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8FDB;&#x7A0B;&#x63D0;&#x524D;&#x5F52;&#x8FD8;&#x4E86;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x90A3;&#x7CFB;&#x7EDF;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x5728;&#x5206;&#x914D;&#x54A8;&#x6E90;&#x4E4B;&#x524D;&#x603B;&#x662F;&#x8981;&#x8003;&#x8651;&#x5230;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;</p>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5904;&#x4E8E;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x5C31;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#xFF08;<strong>&#x5904;&#x4E8E;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#x672A;&#x5FC5;&#x5C31;&#x662F;&#x53D1;&#x751F;&#x4E86;&#x6B7B;&#x9501;&#xFF0C;&#x4F46;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x65F6;&#x4E00;&#x5B9A;&#x662F;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;</strong>)</p>
<p>&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5728;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x4E4B;&#x524D;&#x9884;&#x5148;&#x5224;&#x65AD;&#x8FD9;&#x6B21;&#x5206;&#x914D;&#x662F;&#x5426;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x6B64;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x7B54;&#x5E94;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x201C;&#x94F6;&#x884C;&#x5BB6;&#x7B97;&#x6CD5;&#x201D;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x3002;</p>
<h3 id="442-&#x94F6;&#x884C;&#x5BB6;&#x7B97;&#x6CD5;">4.4.2 &#x94F6;&#x884C;&#x5BB6;&#x7B97;&#x6CD5;</h3>
<p>&#x6838;&#x5FC3;&#x601D;&#x60F3;:&#x5728;&#x8FDB;&#x7A0B;&#x63D0;&#x51FA;&#x8D44;&#x6E90;&#x7533;&#x8BF7;&#x65F6;&#xFF0C;&#x5148;&#x9884;&#x5224;&#x6B64;&#x6B21;&#x5206;&#x914D;&#x662F;&#x5426;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x4F1A;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;&#xFF0C;&#x5C31;&#x6682;&#x65F6;&#x4E0D;&#x7B54;&#x5E94;&#x8FD9;&#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x8BA9;&#x8BE5;&#x8FDB;&#x7A0B;&#x5148;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x3002;</p>
<p><img src="https://upload-images.jianshu.io/upload_images/26868451-07769fbcd2f9445f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;&#x7247;.png"></p>
<p>&#x5047;&#x8BBE;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;n&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;m&#x79CD;&#x8D44;&#x6E90;&#x3002;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x524D;&#x5148;&#x58F0;&#x660E;&#x5BF9;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x5927;&#x9700;&#x6C42;&#x6570;&#xFF0C;&#x5219;&#x53EF;&#x7528;&#x4E00;&#x4E2A;n&#xD7;m&#x7684;&#x77E9;&#x9635;&#xFF08;&#x53EF;&#x7528;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#x5B9E;&#x73B0;&#xFF09;&#x8868;&#x793A;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x5BF9;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x5927;&#x9700;&#x6C42;&#x6570;&#x3002;&#x4E0D;&#x59A8;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x9700;&#x6C42;&#x77E9;&#x9635;Max&#xFF0C;Max[i, j]=K&#x8868;&#x793A;&#x8FDB;&#x7A0B;Pi&#x6700;&#x591A;&#x9700;&#x8981;K&#x4E2A;&#x8D44;&#x6E90;Rj&#x3002;&#x540C;&#x7406;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;n&#xD7;m&#x7684;&#x5206;&#x914D;&#x77E9;&#x9635;Allocation&#x8868;&#x793A;&#x5BF9;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x60C5;&#x51B5;&#x3002;Max - Allocation =Need&#x77E9;&#x9635;&#xFF0C;&#x8868;&#x793A;&#x5404;&#x8FDB;&#x7A0B;&#x6700;&#x591A;&#x8FD8;&#x9700;&#x8981;&#x591A;&#x5C11;&#x5404;&#x7C7B;&#x8D44;&#x6E90;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;m&#x7684;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;Available&#x8868;&#x793A;&#x5F53;&#x524D;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x3002;&#x67D0;&#x8FDB;&#x7A0B;Pi&#x5411;&#x7CFB;&#x7EDF;&#x7533;&#x8BF7;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x7528;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;m&#x7684;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;Request,&#x8868;&#x793A;&#x672C;&#x6B21;&#x7533;&#x8BF7;&#x7684;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x91CF;&#x3002;</p>
<p>&#x94F6;&#x884C;&#x5BB6;&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;:</p>
<p>&#x2460;&#x68C0;&#x67E5;&#x6B64;&#x6B21;&#x7533;&#x8BF7;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x4E86;&#x4E4B;&#x524D;&#x58F0;&#x660E;&#x7684;&#x6700;&#x5927;&#x9700;&#x6C42;&#x6570;</p>
<p>&#x2461;&#x68C0;&#x67E5;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5269;&#x4F59;&#x7684;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x8FD8;&#x80FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x6B21;&#x8BF7;&#x6C42;</p>
<p>&#x2462;&#x8BD5;&#x63A2;&#x7740;&#x5206;&#x914D;&#xFF0C;&#x66F4;&#x6539;&#x5404;&#x6570;&#x636E;&#x7ED3;&#x6784;</p>
<p>&#x2463;&#x7528;&#x5B89;&#x5168;&#x6027;&#x7B97;&#x6CD5;&#x68C0;&#x67E5;&#x6B64;&#x6B21;&#x5206;&#x914D;&#x662F;&#x5426;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x4E0D;&#x5B89;&#x5168;&#x72B6;&#x6001;</p>
<p>&#x5177;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x679C;$Request,[j]&#x2264;Need<a href="O&#x2264;j&#x2264;m">i, j</a>$&#x4FBF;&#x8F6C;&#x5411;2.;&#x5426;&#x5219;&#x8BA4;&#x4E3A;&#x51FA;&#x9519;&#x3002;</li>
<li>&#x5982;&#x679C;$Request;[i]&#x2264;Available[i] (0&#x2264;j&#x2264;m)$&#xFF0C;&#x4FBF;&#x8F6C;&#x5411;3.&#xFE54;&#x5426;&#x5219;&#x8868;&#x793A;&#x5C1A;&#x65E0;&#x8DB3;&#x591F;&#x8D44;&#x6E90;&#xFF0C;Pi&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x3002;</li>
<li>&#x7CFB;&#x7EDF;&#x8BD5;&#x63A2;&#x7740;&#x628A;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7ED9;&#x8FDB;&#x7A0B;Pi&#xFF0C;&#x5E76;&#x4FEE;&#x6539;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x3008;&#x5E76;&#x975E;&#x771F;&#x7684;&#x5206;&#x914D;&#xFF0C;&#x4FEE;&#x6539;&#x6570;&#x503C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x505A;&#x9884;&#x5224;):</li>
</ol>
<pre><code class="lang-C">Available = Available - Request_i;
Allocation[i, j] = Allocation[i, j] + Request_i[j];
Need[i, j] = Need[i, j]-Request,[i]
</code></pre>
<ol>
<li>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x5B89;&#x5168;&#x6027;&#x7B97;&#x6CD5;&#xFF0C;&#x68C0;&#x67E5;&#x6B64;&#x6B21;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x5B89;&#x5168;&#x72B6;&#x6001;&#x3002;&#x82E5;&#x5B89;&#x5168;&#xFF0C;&#x624D;&#x6B63;&#x5F0F;&#x5206;&#x914D;;&#x5426;&#x5219;&#xFF0C;&#x6062;&#x590D;&#x76F8;&#x5E94;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x8FDB;&#x7A0B;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x3002;</li>
</ol>
<p>&#x5B89;&#x5168;&#x6027;&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;:</p>
<ul>
<li>&#x68C0;&#x67E5;&#x5F53;&#x524D;&#x7684;&#x5269;&#x4F59;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x662F;&#x5426;&#x80FD;&#x6EE1;&#x8DB3;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x6700;&#x5927;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#xFF0C;&#x5C31;&#x628A;&#x8BE5;&#x8FDB;&#x7A0B;&#x52A0;&#x5165;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x628A;&#x8BE5;&#x8FDB;&#x7A0B;&#x6301;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x5168;&#x90E8;&#x56DE;&#x6536;&#x3002;</li>
<li>&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#xFF0C;&#x770B;&#x6700;&#x7EC8;&#x662F;&#x5426;&#x80FD;&#x8BA9;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x90FD;&#x52A0;&#x5165;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#x3002;</li>
</ul>
<h2 id="45-&#x6B7B;&#x9501;&#x7684;&#x68C0;&#x6D4B;&#x548C;&#x89E3;&#x9664;">4.5 &#x6B7B;&#x9501;&#x7684;&#x68C0;&#x6D4B;&#x548C;&#x89E3;&#x9664;</h2>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x65E2;&#x4E0D;&#x91C7;&#x53D6;&#x9884;&#x9632;&#x6B7B;&#x9501;&#x7684;&#x63AA;&#x65BD;&#xFF0C;&#x4E5F;&#x4E0D;&#x91C7;&#x53D6;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x7684;&#x63AA;&#x65BD;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x5F88;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5E94;&#x5F53;&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x7B97;&#x6CD5;&#xFF1A;</p>
<p>&#x2460;&#x6B7B;&#x9501;&#x68C0;&#x6D4B;&#x7B97;&#x6CD5;&#xFF1A;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x4E2D;&#x662F;&#x5426;&#x53D1;&#x751F;&#x4E86;&#x6B7B;&#x9501;&#x3002;</p>
<p>&#x2461;&#x6B7B;&#x9501;&#x89E3;&#x9664;&#x7B97;&#x6CD5;&#xFF1A;&#x5F53;&#x8BA4;&#x5B9A;&#x7CFB;&#x7EDF;&#x4E2D;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x4E86;&#x6B7B;&#x9501;&#xFF0C;&#x5229;&#x7528;&#x8BE5;&#x7B97;&#x6CD5;&#x53EF;&#x5C06;&#x7CFB;&#x7EDF;&#x4ECE;&#x6B7B;&#x9501;&#x72B6;&#x6001;&#x4E2D;&#x89E3;&#x8131;&#x51FA;&#x6765;&#x3002;</p>
<h3 id="451-&#x6B7B;&#x9501;&#x7684;&#x68C0;&#x6D4B;">4.5.1 &#x6B7B;&#x9501;&#x7684;&#x68C0;&#x6D4B;</h3>
<h4 id="4511-&#x8D44;&#x6E90;&#x5206;&#x914D;&#x56FE;">4.5.1.1 &#x8D44;&#x6E90;&#x5206;&#x914D;&#x56FE;</h4>
<p>&#x4E3A;&#x4E86;&#x80FD;&#x5BF9;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x5DF2;&#x53D1;&#x751F;&#x4E86;&#x6B7B;&#x9501;&#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#xFF0C;&#x5FC5;&#x987B;&#xFF1A;</p>
<ul>
<li>&#x7528;&#x67D0;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x4FDD;&#x5B58;&#x8D44;&#x6E90;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x5206;&#x914D;&#x4FE1;&#x606F;&#xFF1B;</li>
<li>&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x5229;&#x7528;&#x4E0A;&#x8FF0;&#x4FE1;&#x606F;&#x6765;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x5DF2;&#x8FDB;&#x5165;&#x6B7B;&#x9501;&#x72B6;&#x6001;&#x3002;</li>
</ul>
<p>&#x7CFB;&#x7EDF;&#x6B7B;&#x9501;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x56FE;&#x6765;&#x63CF;&#x8FF0;</p>
<p>&#x542B;&#x6709;&#x4E24;&#x4E2A;&#x7ED3;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x8FDB;&#x7A0B;&#x7ED3;&#x70B9;:&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF1B;</li>
<li>&#x8D44;&#x6E90;&#x7ED3;&#x70B9;:&#x5BF9;&#x5E94;&#x4E00;&#x7C7B;&#x8D44;&#x6E90;&#xFF0C;&#x4E00;&#x7C7B;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#xFF1B;</li>
</ul>
<p>&#x542B;&#x6709;&#x4E24;&#x79CD;&#x8FB9;&#xFF1A;</p>
<ul>
<li>&#x8FDB;&#x7A0B;&#x7ED3;&#x70B9;&#x2014;&gt;&#x8D44;&#x6E90;&#x7ED3;&#x70B9;:&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x60F3;&#x7533;&#x8BF7;&#x51E0;&#x4E2A;&#x8D44;&#x6E90;(&#x6BCF;&#x6761;&#x8FB9;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;)&#xFF1B;</li>
<li>&#x8D44;&#x6E90;&#x8282;&#x70B9;&#x2014;&gt;&#x8FDB;&#x7A0B;&#x7ED3;&#x70B9;&#x2236;&#x8868;&#x793A;&#x5DF2;&#x7ECF;&#x4E3A;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x4E86;&#x51E0;&#x4E2A;&#x8D44;&#x6E90;&#xFF08;&#x6BCF;&#x6761;&#x8FB9;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;)</li>
</ul>
<p><img src="https://upload-images.jianshu.io/upload_images/26868451-9d1212ef28132184.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;&#x7247;.png"></p>
<h4 id="4512-&#x6B7B;&#x9501;&#x5B9A;&#x7406;">4.5.1.2 &#x6B7B;&#x9501;&#x5B9A;&#x7406;</h4>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5269;&#x4F59;&#x7684;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x6570;&#x8DB3;&#x591F;&#x6EE1;&#x8DB3;&#x8FDB;&#x7A0B;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x6682;&#x65F6;&#x662F;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x987A;&#x5229;&#x5730;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x4E86;&#x628A;&#x8D44;&#x6E90;&#x5F52;&#x8FD8;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x4F7F;&#x67D0;&#x4E9B;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x8D44;&#x6E90;&#x7684;&#x8FDB;&#x7A0B;&#x88AB;&#x6FC0;&#x6D3B;&#xFF0C;&#x5E76;&#x987A;&#x5229;&#x5730;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x88AB;&#x6FC0;&#x6D3B;&#x7684;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#x53C8;&#x4F1A;&#x5F52;&#x8FD8;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x53C8;&#x4F1A;&#x6FC0;&#x6D3B;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x963B;&#x585E;&#x7684;&#x8FDB;&#x7A0B;&#x2026;</p>
<p>&#x5982;&#x679C;&#x6309;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#x5206;&#x6790;&#xFF0C;&#x6700;&#x7EC8;&#x80FD;&#x6D88;&#x9664;&#x6240;&#x6709;&#x8FB9;&#xFF0C;&#x5C31;&#x79F0;&#x8FD9;&#x4E2A;&#x56FE;&#x662F;&#x53EF;&#x5B8C;&#x5168;&#x7B80;&#x5316;&#x7684;&#x3002;&#x6B64;&#x65F6;&#x4E00;&#x5B9A;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#xFF08;&#x76F8;&#x5F53;&#x4E8E;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x5E8F;&#x5217;&#xFF09;&#xFF1B;&#x5982;&#x679C;&#x6700;&#x7EC8;&#x4E0D;&#x80FD;&#x6D88;&#x9664;&#x6240;&#x6709;&#x8FB9;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x5C31;&#x662F;&#x53D1;&#x751F;&#x4E86;&#x6B7B;&#x9501;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x8FDE;&#x7740;&#x8FB9;&#x7684;&#x90A3;&#x4E9B;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x5904;&#x4E8E;&#x6B7B;&#x9501;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x68C0;&#x6D4B;&#x6B7B;&#x9501;&#x7684;&#x7B97;&#x6CD5;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x56FE;&#x4E2D;&#xFF0C;&#x627E;&#x51FA;&#x65E2;&#x4E0D;&#x963B;&#x585E;&#x53C8;&#x4E0D;&#x662F;&#x5B64;&#x70B9;&#x7684;&#x8FDB;&#x7A0B;Pi&#xFF08;&#x5373;&#x627E;&#x51FA;&#x4E00;&#x6761;&#x6709;&#x5411;&#x8FB9;&#x4E0E;&#x5B83;&#x76F8;&#x8FDE;&#xFF0C;&#x4E14;&#x8BE5;&#x6709;&#x5411;&#x8FB9;&#x5BF9;&#x5E94;&#x8D44;&#x6E90;&#x7684;&#x7533;&#x8BF7;&#x6570;&#x91CF;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5DF2;&#x6709;&#x7A7A;&#x95F2;&#x8D44;&#x6E90;&#x6570;&#x91CF;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x4E2D;&#xFF0C;R1&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x8D44;&#x6E90;&#xFF0C;R2&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x8D44;&#x6E90;&#x3002;&#x82E5;&#x6240;&#x6709;&#x7684;&#x8FDE;&#x63A5;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8FB9;&#x5747;&#x6EE1;&#x8DB3;&#x4E0A;&#x8FF0;&#x6761;&#x4EF6;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x80FD;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x5B8C;&#x6210;&#xFF0C;&#x7136;&#x540E;&#x91CA;&#x653E;&#x5B83;&#x6240;&#x5360;&#x6709;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF09;&#x3002;&#x6D88;&#x53BB;&#x5B83;&#x6240;&#x6709;&#x7684;&#x8BF7;&#x6C42;&#x8FB9;&#x548C;&#x5206;&#x914D;&#x53D8;&#xFF0C;&#x4F7F;&#x4E4B;&#x79F0;&#x4E3A;&#x5B64;&#x7ACB;&#x7684;&#x7ED3;&#x70B9;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;Pi &#x6240;&#x91CA;&#x653E;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x5524;&#x9192;&#x67D0;&#x4E9B;&#x56E0;&#x7B49;&#x5F85;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x800C;&#x963B;&#x585E;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x539F;&#x6765;&#x7684;&#x963B;&#x585E;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x53D8;&#x4E3A;&#x975E;&#x963B;&#x585E;&#x8FDB;&#x7A0B;&#x3002;&#x5728;&#x4E0B;&#x56FE;&#x4E2D;&#xFF0C;P2 &#x5C31;&#x6EE1;&#x8DB3;&#x8FD9;&#x6837;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x6839;&#x636E;1&#xFF09;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7B80;&#x5316;&#x540E;&#xFF0C;&#x82E5;&#x80FD;&#x6D88;&#x53BB;&#x9014;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x8FB9;&#xFF0C;&#x5219;&#x79F0;&#x8BE5;&#x56FE;&#x662F;&#x53EF;&#x5B8C;&#x5168;&#x7B80;&#x5316;&#x7684;&#x3002;</li>
</ol>
<p>&#x6B7B;&#x9501;&#x5B9A;&#x7406;&#xFF1A;&#x5982;&#x679C;&#x67D0;&#x65F6;&#x523B;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x56FE;&#x662F;&#x4E0D;&#x53EF;&#x5B8C;&#x5168;&#x7B80;&#x5316;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x6B7B;&#x9501;</p>
<h3 id="452-&#x6B7B;&#x9501;&#x7684;&#x89E3;&#x9664;">4.5.2 &#x6B7B;&#x9501;&#x7684;&#x89E3;&#x9664;</h3>
<p>&#x4E00;&#x65E6;&#x68C0;&#x6D4B;&#x51FA;&#x6B7B;&#x9501;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x7ACB;&#x5373;&#x89E3;&#x9664;&#x6B7B;&#x9501;&#x3002;</p>
<p>&#x89E3;&#x9664;&#x6B7B;&#x9501;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x6709;&#xFF1A;</p>
<ol>
<li>&#x8D44;&#x6E90;&#x5265;&#x593A;&#x6CD5;&#x3002;&#x6302;&#x8D77;&#xFF08;&#x6682;&#x65F6;&#x653E;&#x5230;&#x5916;&#x5B58;&#x4E0A;&#xFF09;&#x67D0;&#x4E9B;&#x6B7B;&#x9501;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E76;&#x62A2;&#x5360;&#x5B83;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x4ED6;&#x7684;&#x6B7B;&#x9501;&#x8FDB;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x5E94;&#x9632;&#x6B62;&#x88AB;&#x6302;&#x8D77;&#x7684;&#x8FDB;&#x7A0B;&#x957F;&#x65F6;&#x95F4;&#x5F97;&#x4E0D;&#x5230;&#x8D44;&#x6E90;&#x800C;&#x9965;&#x997F;&#x3002;</li>
<li>&#x64A4;&#x9500;&#x8FDB;&#x7A0B;&#x6CD5;&#xFF08;&#x6216;&#x79F0;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x6CD5;&#xFF09;&#x3002;&#x5F3A;&#x5236;&#x64A4;&#x9500;&#x90E8;&#x5206;&#x3001;&#x751A;&#x81F3;&#x5168;&#x90E8;&#x6B7B;&#x9501;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E76;&#x5265;&#x593A;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x6240;&#x4ED8;&#x51FA;&#x7684;&#x4EE3;&#x4EF7;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x5927;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x5DF2;&#x7ECF;&#x63A5;&#x8FD1;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x4E00;&#x65E6;&#x88AB;&#x7EC8;&#x6B62;&#x53EF;&#x8C13;&#x529F;&#x4E8F;&#x4E00;&#x7BD1;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x5F97;&#x4ECE;&#x5934;&#x518D;&#x6765;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;&#x56DE;&#x9000;&#x6CD5;&#x3002;&#x8BA9;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6B7B;&#x9501;&#x8FDB;&#x7A0B;&#x56DE;&#x9000;&#x5230;&#x8DB3;&#x4EE5;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x7684;&#x5730;&#x6B65;&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x8981;&#x8BB0;&#x5F55;&#x8FDB;&#x7A0B;&#x7684;&#x5386;&#x53F2;&#x4FE1;&#x606F;&#xFF0C;&#x8BBE;&#x7F6E;&#x8FD8;&#x539F;&#x70B9;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="3.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第三节  进程同步">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四节 死锁","level":"1.3.4","depth":2,"next":{"title":"第三章 内存管理","level":"1.4","depth":1,"ref":"","articles":[{"title":"第一节 内存管理概念","level":"1.4.1","depth":2,"path":"03/1.md","ref":"03/1.md","articles":[]},{"title":"第二节 虚拟内存管理","level":"1.4.2","depth":2,"path":"03/2.md","ref":"03/2.md","articles":[]}]},"previous":{"title":"第三节  进程同步","level":"1.3.3","depth":2,"path":"02/3.md","ref":"02/3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex","livereload"],"pluginsConfig":{"katex":{},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"02/4.md","mtime":"2022-04-01T10:57:56.228Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-01T13:02:49.140Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

