
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一节 操作系统的基本概念 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    第一章 计算机系统概述
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="1.html">
            
                <a href="1.html">
            
                    
                    第一节 操作系统的基本概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="2.html">
            
                <a href="2.html">
            
                    
                    第二节 操作系统的发展与分类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="3.html">
            
                <a href="3.html">
            
                    
                    第三节 操作系统的运行环境
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="4.html">
            
                <a href="4.html">
            
                    
                    第四节 操作系统的体系结构
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    第二章 进程管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../02/1.html">
            
                <a href="../02/1.html">
            
                    
                    第一节 进程与线程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../02/2.html">
            
                <a href="../02/2.html">
            
                    
                    第二节 处理机调度
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../02/3.html">
            
                <a href="../02/3.html">
            
                    
                    第三节  进程同步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../02/4.html">
            
                <a href="../02/4.html">
            
                    
                    第四节 死锁
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    第三章 内存管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../03/1.html">
            
                <a href="../03/1.html">
            
                    
                    第一节 内存管理概念
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../03/2.html">
            
                <a href="../03/2.html">
            
                    
                    第二节 虚拟内存管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    第四章 文件管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../04/1.html">
            
                <a href="../04/1.html">
            
                    
                    第一节  文件系统基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../04/2.html">
            
                <a href="../04/2.html">
            
                    
                    第二节 文件系统实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../04/3.html">
            
                <a href="../04/3.html">
            
                    
                    第三节 磁盘组织及管理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    第五章 输入输出管理
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../05/1.html">
            
                <a href="../05/1.html">
            
                    
                    第一节 I/O管理概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="../05/2.html">
            
                <a href="../05/2.html">
            
                    
                    第二节 I/O核心子系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第一节 操作系统的基本概念</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E00;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;">&#x4E00;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h1>
<h2 id="11-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;">1.1 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6982;&#x5FF5;</h2>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;Operating System&#xFF0C; OS&#xFF09;&#x662F;&#x6307;&#x63A7;&#x5236;&#x548C;&#x7BA1;&#x7406;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x5408;&#x7406;&#x5730;&#x7EC4;&#x7EC7;&#x8C03;&#x5EA6;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5DE5;&#x4F5C;&#x548C;&#x8D44;&#x6E90;&#x7684;&#x5206;&#x914D;&#xFF1B;&#x4EE5;&#x63D0;&#x4F9B;&#x7ED9;&#x7528;&#x6237;&#x548C;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x65B9;&#x4FBF;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x73AF;&#x5883;&#xFF1B;&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x3002;</p>
<h2 id="12-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x548C;&#x76EE;&#x6807;">1.2 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x548C;&#x76EE;&#x6807;</h2>
<h3 id="121-&#x4F5C;&#x4E3A;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x7BA1;&#x7406;&#x8005;">1.2.1 &#x4F5C;&#x4E3A;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#x7BA1;&#x7406;&#x8005;</h3>
<ol>
<li>&#x5904;&#x7406;&#x673A;&#x7BA1;&#x7406;</li>
</ol>
<p>&#x5728;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5904;&#x7406;&#x673A;&#x7684;&#x5206;&#x914D;&#x548C;&#x8FD0;&#x884C;&#x90FD;&#x4EE5;&#x8FDB;&#x7A0B;&#xFF08;&#x6216;&#x7EBF;&#x7A0B;&#xFF09;&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x56E0;&#x800C;&#x5BF9;&#x5904;&#x7406;&#x673A;&#x7684;&#x7BA1;&#x7406;&#x53EF;&#x5F52;&#x7ED3;&#x4E3A;&#x5BF9;&#x8FDB;&#x7A0B;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x5E76;&#x53D1;&#x662F;&#x6307;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x8FDB;&#x7A0B;&#x4F55;&#x65F6;&#x521B;&#x5EFA;&#x3001;&#x4F55;&#x65F6;&#x64A4;&#x9500;&#x3001;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x3001;&#x5982;&#x4F55;&#x907F;&#x514D;&#x51B2;&#x7A81;&#x3001;&#x5408;&#x7406;&#x5171;&#x4EAB;&#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x7BA1;&#x7406;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8FDB;&#x7A0B;&#x7BA1;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x5305;&#x62EC;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x3001;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x3001;&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#x3001;&#x6B7B;&#x9501;&#x5904;&#x7406;&#x3001;&#x5904;&#x7406;&#x673A;&#x8C03;&#x5EA6;&#x7B49;&#x3002;</p>
<ol>
<li>&#x5B58;&#x50A8;&#x5668;&#x7BA1;&#x7406;</li>
</ol>
<p>&#x5B58;&#x50A8;&#x5668;&#x7BA1;&#x7406;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x53CA;&#x63D0;&#x9AD8;&#x5185;&#x5B58;&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E0E;&#x56DE;&#x6536;&#x3001;&#x5730;&#x5740;&#x6620;&#x5C04;&#x3001;&#x5185;&#x5B58;&#x4FDD;&#x62A4;&#x4E0E;&#x5171;&#x4EAB;&#x548C;&#x5185;&#x5B58;&#x6269;&#x5145;&#x7B49;&#x529F;&#x80FD;&#x3002;</p>
<ol>
<li>&#x6587;&#x4EF6;&#x7BA1;&#x7406;</li>
</ol>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x4EE5;&#x6587;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D1F;&#x8D32;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#x7684;&#x90E8;&#x5206;&#x79F0;&#x4E3A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#x5305;&#x62EC;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x7BA1;&#x7406;&#x3001;&#x76EE;&#x5F55;&#x7BA1;&#x7406;&#x53CA;&#x6587;&#x4EF6;&#x8BFB;&#x5199;&#x7BA1;&#x7406;&#x548C;&#x4FDD;&#x62A4;&#x7B49;&#x3002;</p>
<ol>
<li>&#x8BBE;&#x5907;&#x7BA1;&#x7406;</li>
</ol>
<p>&#x8BBE;&#x5907;&#x7BA1;&#x7406;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x5B8C;&#x6210;&#x7528;&#x6237;&#x7684;IO&#x8BF7;&#x6C42;&#xFF0C;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#xFF0C;&#x5E76;&#x63D0;&#x9AD8;&#x8BBE;&#x5907;&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x7F13;&#x51B2;&#x7BA1;&#x7406;&#x3001;&#x8BBE;&#x5907;&#x5206;&#x914D;&#x3001;&#x8BBE;&#x5907;&#x5904;&#x7406;&#x548C;&#x865A;&#x62DF;&#x8BBE;&#x5907;&#x7B49;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="122-&#x5411;&#x4E0A;&#x5C42;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x6613;&#x7528;&#x7684;&#x670D;&#x52A1;">1.2.2 &#x5411;&#x4E0A;&#x5C42;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x6613;&#x7528;&#x7684;&#x670D;&#x52A1;</h3>
<ol>
<li>&#x547D;&#x4EE4;&#x63A5;&#x53E3;</li>
</ol>
<p>&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x4F5C;&#x4E1A;&#x63A7;&#x5236;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x5373;&#x8054;&#x673A;&#x63A7;&#x5236;&#x65B9;&#x5F0F;&#x548C;&#x8131;&#x673A;&#x63A7;&#x5236;&#x65B9;&#x5F0F;&#x3002;&#x6309;&#x4F5C;&#x4E1A;&#x63A7;&#x5236;&#x65B9;&#x5F0F;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x53EF;&#x5C06;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#x5206;&#x4E3A;&#x8054;&#x673A;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#x548C;&#x8131;&#x673A;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#x3002;</p>
<ul>
<li>&#x8054;&#x673A;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x8BF4;&#x4E00;&#x53E5;&#xFF0C;&#x7CFB;&#x7EDF;&#x8DDF;&#x7740;&#x505A;&#x4E00;&#x53E5;&#x3002;&#x5982;&#x547D;&#x4EE4;&#x884C;CMD&#x7B49;&#x7B49;</li>
<li><p>&#x8131;&#x673A;&#x547D;&#x4EE4;&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x8BF4;&#x4E00;&#x5806;&#xFF0C;&#x7CFB;&#x7EDF;&#x8DDF;&#x7740;&#x505A;&#x4E00;&#x5806;&#x3002;&#x5982;&#x6279;&#x5904;&#x7406;&#x547D;&#x4EE4;&#x63A5;&#x53E3;bat&#x7B49;&#x7B49;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;</p>
</li>
</ul>
<p>&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;&#x7531;&#x4E00;&#x7EC4;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF08;&#x4E5F;&#x79F0;&#x5E7F;&#x4E49;&#x6307;&#x4EE4;&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6765;&#x8BF7;&#x6C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3001;&#x5982;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x5916;&#x90E8;&#x8BBE;&#x5907;&#x3001;&#x7533;&#x8BF7;&#x5206;&#x914D;&#x548C;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x53CA;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x8981;&#x6C42;&#x3002;</p>
<blockquote>
<p>&#x666E;&#x901A;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7B80;&#x4ECB;&#x4F7F;&#x7528;</p>
</blockquote>
<h3 id="123-&#x5BF9;&#x786C;&#x4EF6;&#x673A;&#x5668;&#x7684;&#x62D3;&#x5C55;">1.2.3 &#x5BF9;&#x786C;&#x4EF6;&#x673A;&#x5668;&#x7684;&#x62D3;&#x5C55;</h3>
<p>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x652F;&#x6301;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6210;&#x4E3A;&#x88F8;&#x673A;&#x3002;&#x5728;&#x88F8;&#x673A;&#x4E0A;&#x5B89;&#x88C5;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x548C;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x7684;&#x670D;&#x52A1;&#x529F;&#x80FD;&#xFF0C;&#x5C06;&#x88F8;&#x673A;&#x6539;&#x9020;&#x6210;&#x529F;&#x80FD;&#x66F4;&#x5F3A;&#x3001;&#x4F7F;&#x7528;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x673A;&#x5668;</p>
<p>&#x901A;&#x5E38;&#x628A;&#x8986;&#x76D6;&#x4E86;&#x8F6F;&#x4EF6;&#x7684;&#x673A;&#x5668;&#x6210;&#x4E3A;&#x6269;&#x5145;&#x673A;&#x5668;&#xFF0C;&#x53C8;&#x79F0;&#x4E4B;&#x4E3A;&#x865A;&#x62DF;&#x673A;</p>
<h2 id="13-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x5F81;">1.3 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x5F81;</h2>
<h3 id="131-&#x5E76;&#x53D1;">1.3.1 &#x5E76;&#x53D1;</h3>
<p>&#x5E76;&#x53D1;&#xFF1A;&#x6307;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#x53D1;&#x751F;&#x3002;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x5B8F;&#x89C2;&#x4E0A;&#x662F;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x4F46;&#x5FAE;&#x89C2;&#x4E0A;&#x662F;&#x4EA4;&#x66FF;&#x53D1;&#x751F;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x533A;&#x522B;&#x5E76;&#x884C;&#x548C;&#x5E76;&#x53D1;&#x7684;&#x533A;&#x522B;</p>
<p>&#x5E76;&#x884C;&#xFF1A;&#x6307;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x3002;</p>
</blockquote>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x6307;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#x201C;&#x540C;&#x65F6;&#x201D;&#x8FD0;&#x884C;&#x7740;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5B8F;&#x89C2;&#x4E0A;&#x770B;&#x662F;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7740;&#x7684;&#xFF0C;&#x800C;&#x5FAE;&#x89C2;&#x4E0A;&#x770B;&#x662F;&#x4EA4;&#x66FF;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x4F34;&#x968F;&#x7740;&#x201C;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x6280;&#x672F;&#x201D;&#x800C;&#x51FA;&#x73B0;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x662F;&#x4E00;&#x8D77;&#x8BDE;&#x751F;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x5355;&#x6838;CPU&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5404;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EA;&#x80FD;&#x5E76;&#x53D1;&#x5730;&#x6267;&#x884C;</p>
<p>&#x591A;&#x6838;CPU&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5730;&#x6267;&#x884C;</p>
<p>&#x5982;4 &#x6838;CPU&#xFF0C;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x5730;&#x6267;&#x884C;4&#x4E2A;&#x7A0B;&#x5E8F;</p>
</blockquote>
<h3 id="132-&#x5171;&#x4EAB;">1.3.2 &#x5171;&#x4EAB;</h3>
<p>&#x5171;&#x4EAB;&#x5373;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#xFF0C;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8D44;&#x6E90;&#x53EF;&#x4F9B;&#x5185;&#x5B58;&#x4E2D;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x5171;&#x540C;&#x4F7F;&#x7528;&#x3002;</p>
<ul>
<li>&#x4E92;&#x65A5;&#x5171;&#x4EAB;&#x65B9;&#x5F0F;&#xFF1A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7ED9;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x8BE5;&#x8D44;&#x6E90;</li>
<li>&#x540C;&#x65F6;&#x5171;&#x4EAB;&#x65B9;&#x5F0F;&#xFF1A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x8D44;&#x6E90;&#xFF0C;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x7531;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x201C;&#x540C;&#x65F6;&#x201D;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;</li>
</ul>
<blockquote>
<p>&#x6240;&#x8C13;&#x7684;&#x201C;&#x540C;&#x65F6;&#x201D;&#x5F80;&#x5F80;&#x662F;&#x5B8F;&#x89C2;&#x4E0A;&#x7684;&#xFF0C;&#x800C;&#x5728;&#x5FAE;&#x89C2;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x662F;&#x4EA4;&#x66FF;&#x5730;&#x5BF9;&#x8BE5;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x7684;,&#x5373;&#x5206;&#x65F6;&#x5171;&#x4EAB;</p>
<p>&#x5E76;&#x53D1;&#x548C;&#x5171;&#x4EAB;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E24;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x4E92;&#x4E3A;&#x5B58;&#x5728;&#x7684;&#x6761;&#x4EF6;:&#x2460;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x662F;&#x4EE5;&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x4E3A;&#x6761;&#x4EF6;&#x7684;&#xFF0C;&#x82E5;&#x7CFB;&#x7EDF;&#x4E0D;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x5219;&#x81EA;&#x7136;&#x4E0D;&#x5B58;&#x5728;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x95EE;&#x9898;;&#x2461;&#x82E5;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x5BF9;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x5B9E;&#x65BD;&#x6709;&#x6548;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x5219;&#x5FC5;&#x5C06;&#x5F71;&#x54CD;&#x5230;&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x751A;&#x81F3;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;</p>
</blockquote>
<h3 id="133-&#x865A;&#x62DF;">1.3.3 &#x865A;&#x62DF;</h3>
<p>&#x865A;&#x62DF;&#x662F;&#x6307;&#x628A;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x5B9E;&#x4F53;&#x53D8;&#x4E3A;&#x82E5;&#x5E72;&#x4E2A;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5BF9;&#x5E94;&#x7269;&#x3002;&#x7269;&#x7406;&#x5B9E;&#x4F53;&#xFF08;&#x524D;&#x8005;&#xFF09;&#x662F;&#x5B9E;&#x9645;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x800C;&#x903B;&#x8F91;&#x4E0A;&#x5BF9;&#x5E94;&#x7269;&#xFF08;&#x540E;&#x8005;&#xFF09;&#x662F;&#x7528;&#x6237;&#x611F;&#x53D7;&#x5230;&#x7684;&#x3002;</p>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x865A;&#x62DF;&#x6280;&#x672F;&#x53EF;&#x5F52;&#x7EB3;&#x4E3A;:&#x65F6;&#x5206;&#x590D;&#x7528;&#x6280;&#x672F;&#xFF0C;&#x5982;&#x5904;&#x7406;&#x5668;&#x7684;&#x5206;&#x65F6;&#x5171;&#x4EAB;:&#x7A7A;&#x5206;&#x590D;&#x7528;&#x6280;&#x672F;,&#x5982;&#x865A;&#x62DF;&#x5B58;&#x50A8;&#x5668;&#x3002;</p>
<h3 id="134-&#x5F02;&#x6B65;">1.3.4 &#x5F02;&#x6B65;</h3>
<p>&#x5F02;&#x6B65;&#x662F;&#x6307;&#xFF0C;&#x5728;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x4E0D;&#x662F;&#x4E00;&#x8D2F;&#x5230;&#x5E95;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x8D70;&#x8D70;&#x505C;&#x505C;&#xFF0C;&#x4EE5;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x901F;&#x5EA6;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x7684;&#x5F02;&#x6B65;&#x6027;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="2.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 第二节 操作系统的发展与分类">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一节 操作系统的基本概念","level":"1.2.1","depth":2,"next":{"title":"第二节 操作系统的发展与分类","level":"1.2.2","depth":2,"path":"01/2.md","ref":"01/2.md","articles":[]},"previous":{"title":"第一章 计算机系统概述","level":"1.2","depth":1,"ref":"","articles":[{"title":"第一节 操作系统的基本概念","level":"1.2.1","depth":2,"path":"01/1.md","ref":"01/1.md","articles":[]},{"title":"第二节 操作系统的发展与分类","level":"1.2.2","depth":2,"path":"01/2.md","ref":"01/2.md","articles":[]},{"title":"第三节 操作系统的运行环境","level":"1.2.3","depth":2,"path":"01/3.md","ref":"01/3.md","articles":[]},{"title":"第四节 操作系统的体系结构","level":"1.2.4","depth":2,"path":"01/4.md","ref":"01/4.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["katex","livereload"],"pluginsConfig":{"katex":{},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01/1.md","mtime":"2022-04-01T10:48:37.380Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-01T13:02:49.140Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

